//二维数组
#include <stdio.h>

void test0()
{
	int a[2][3]; //由a[0]和a[1]组成，2行3列6个元素的二维数组
	printf("数组的地址1：%d\n", a);
	//a[0]也是个数组，所以a[0]就是数组名，就代表着这个数组的地址
	printf("数组的地址2：%d\n", a[0]);
	printf("数组的地址3：%d\n", &a[0][0]);
	printf("%d\n", a[1]);
	printf("%d\n", &a[1][0]);
}

void test1()//二维数组的初始化
{
	int a[2][3] = {{1,2,3}, {4,5,6}};//二维数组按行存储
	int b[2][3] = {1,2,3,4}; //未赋值，默认0
	//如果只初始化了部分元素，可以省略行数，不能省略列数
	int c[][3] = {1,2,3,4,5};
	//a[0][0]=1; a[0][1]=2; a[0][2]=3;
	//a[1][0]=4; a[1][1]=5;
}

int main(int argc, char *argv[])
{
	
	return 0;
}
